#include <stdio.h>
#include <string.h>
#include <stdlib.h>

int main(){
        int n = 0; //колво строк до
        int m = 0; //колво строк после    
        char** strcs = NULL; // это ДВУМЕРНЫЙ массив, в строках которого отдельные предложения уже расщипленные  
 	size_t strs_len = 0; 
	char c; //эта переменная создана чтобы хранить в ней текущий символ    
	while(1){//тут создается бесконечный по своей сути цикл, коорый будет считывать данныеЯ, пока не встретит терминальную строку, тоесть то самое предложение, которое указано в задании
				
		






	}


        return 0;
}
